#+title:  Chapter 2
#+author: Reinhard Stahn
#+setupfile: ./inc/setupfile.org
#+include: ./inc/latex-macros.org
#+property: header-args:python :session *chapter-2* :tangle chapter_2.py

#+toc: headlines 2

*** Proof
Suppose a Schmidt-like decomposition is possible for a state with respect to ABC. Then the reduced
density operators in A, B and C must have the same set of eigenvalues. Hence, to show that such a
decomposition is not possible for a given state it suffices to show that the sets of eigenvalue are
not all equal.

To spare us boring calculations lets introduce a nice function which takes a state vector of a
three-qubit system ABC as input (this is already the simplest case where we can find counter
examples). As output it reports the eigenvalues of the density matrix of each subsystem.

#+name: exercise-2-77-1
#+begin_src python
  def get_eigenvals_of_ABC(state_vector: Matrix):
      """Calculate eigenvals of subsystems of three-qubit system (for Exercise 2.77)."""
      density = state_vector * state_vector.H
      DA = ptrace(density, [1, 2])
      DB = ptrace(density, [0, 2])
      DC = ptrace(density, [0, 1])

      result = ""
      for S, D in [("A", DA), ("B", DB), ("C", DC)]:
          result += f"Eigenvalues in {S}: {D.eigenvals()}.\n"

      return result
#+end_src

The following code-snippit shows that

$$
  \frac{1}{\sqrt{3}} (|000\rangle + |010\rangle + |011\rangle)
$$

cannot be decomposed as required:

#+name: exercise-2-77-2
#+begin_src python :tangle no :results replace :cache yes
  get_eigenvals_of_ABC((ket('000') + ket('010') + ket('011')) / sqrt(3))
#+end_src

#+RESULTS[786787d8d21b1e565140d71f386acfaa13e3d19c]: exercise-2-77-2
: Eigenvalues in A: {1/2 - sqrt(5)/6: 1, sqrt(5)/6 + 1/2: 1}.
: Eigenvalues in B: {1/2 - sqrt(5)/6: 1, sqrt(5)/6 + 1/2: 1}.
: Eigenvalues in C: {1: 1, 0: 1}.

QED.

